4ops.terraform
anysphere.pyright
charliermarsh.ruff
github.vscode-github-actions
github.vscode-pull-request-github
goessner.mdmath
grapecity.gc-excelviewer
kamikillerto.vscode-colorize
kevinrose.vsc-python-indent
matangover.mypy
me-dutour-mathieu.vscode-github-actions
mechatroner.rainbow-csv
mhutchie.git-graph
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.pylint
ms-python.python
ms-python.vscode-pylance
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.tensorboard
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ninoseki.vscode-mogami
redhat.vscode-yaml
streetsidesoftware.code-spell-checker
tamasfe.even-better-toml
usernamehw.errorlens